benchmarks/localhost_read/500_mb_concurrent_reads_tcp.log
concurrent_reads: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
fio-3.38-36-g2768c
Starting 16 processes

concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862696: Sun Feb 16 18:40:00 2025
  read: IOPS=93, BW=373KiB/s (381kB/s)(21.8MiB/60019msec)
    slat (usec): min=1303, max=24525, avg=10724.57, stdev=3363.40
    clat (msec): min=6, max=232, avg=160.83, stdev=45.90
     lat (msec): min=18, max=247, avg=171.55, stdev=48.74
    clat percentiles (msec):
     |  1.00th=[   44],  5.00th=[   56], 10.00th=[   91], 20.00th=[  124],
     | 30.00th=[  148], 40.00th=[  165], 50.00th=[  178], 60.00th=[  184],
     | 70.00th=[  190], 80.00th=[  199], 90.00th=[  207], 95.00th=[  215],
     | 99.00th=[  224], 99.50th=[  226], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  234]
   bw (  KiB/s): min=  264, max= 1208, per=6.01%, avg=372.67, stdev=127.46, samples=120
   iops        : min=   66, max=  302, avg=93.17, stdev=31.86, samples=120
  lat (msec)   : 10=0.02%, 20=0.02%, 50=2.02%, 100=12.29%, 250=85.65%
  cpu          : usr=0.15%, sys=0.28%, ctx=10315, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5590,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862697: Sun Feb 16 18:40:00 2025
  read: IOPS=89, BW=358KiB/s (366kB/s)(21.0MiB/60011msec)
    slat (usec): min=2128, max=24694, avg=11175.64, stdev=3048.43
    clat (msec): min=9, max=233, avg=167.59, stdev=40.53
     lat (msec): min=23, max=248, avg=178.77, stdev=42.98
    clat percentiles (msec):
     |  1.00th=[   62],  5.00th=[   78], 10.00th=[   96], 20.00th=[  140],
     | 30.00th=[  157], 40.00th=[  171], 50.00th=[  180], 60.00th=[  186],
     | 70.00th=[  192], 80.00th=[  201], 90.00th=[  211], 95.00th=[  218],
     | 99.00th=[  226], 99.50th=[  228], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  234]
   bw (  KiB/s): min=  264, max=  816, per=5.77%, avg=357.61, stdev=94.00, samples=120
   iops        : min=   66, max=  204, avg=89.40, stdev=23.50, samples=120
  lat (msec)   : 10=0.02%, 50=0.30%, 100=10.09%, 250=89.60%
  cpu          : usr=0.16%, sys=0.25%, ctx=10254, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5364,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862698: Sun Feb 16 18:40:00 2025
  read: IOPS=96, BW=386KiB/s (395kB/s)(22.6MiB/60012msec)
    slat (usec): min=2213, max=21599, avg=10358.34, stdev=3461.67
    clat (msec): min=8, max=232, avg=155.34, stdev=47.52
     lat (msec): min=22, max=247, avg=165.70, stdev=50.48
    clat percentiles (msec):
     |  1.00th=[   57],  5.00th=[   66], 10.00th=[   81], 20.00th=[  102],
     | 30.00th=[  138], 40.00th=[  155], 50.00th=[  171], 60.00th=[  182],
     | 70.00th=[  188], 80.00th=[  197], 90.00th=[  207], 95.00th=[  215],
     | 99.00th=[  224], 99.50th=[  226], 99.90th=[  230], 99.95th=[  232],
     | 99.99th=[  232]
   bw (  KiB/s): min=  264, max=  984, per=6.22%, avg=385.80, stdev=131.07, samples=120
   iops        : min=   66, max=  246, avg=96.45, stdev=32.77, samples=120
  lat (msec)   : 10=0.02%, 50=0.41%, 100=19.20%, 250=80.37%
  cpu          : usr=0.16%, sys=0.27%, ctx=10388, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5787,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862699: Sun Feb 16 18:40:00 2025
  read: IOPS=97, BW=392KiB/s (401kB/s)(22.9MiB/60011msec)
    slat (usec): min=2136, max=26365, avg=10203.43, stdev=3636.94
    clat (msec): min=9, max=232, avg=153.02, stdev=50.38
     lat (msec): min=22, max=247, avg=163.23, stdev=53.54
    clat percentiles (msec):
     |  1.00th=[   50],  5.00th=[   64], 10.00th=[   72], 20.00th=[   92],
     | 30.00th=[  133], 40.00th=[  155], 50.00th=[  171], 60.00th=[  182],
     | 70.00th=[  188], 80.00th=[  197], 90.00th=[  209], 95.00th=[  215],
     | 99.00th=[  226], 99.50th=[  228], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  232]
   bw (  KiB/s): min=  264, max= 1024, per=6.32%, avg=391.67, stdev=147.95, samples=120
   iops        : min=   66, max=  256, avg=97.92, stdev=36.99, samples=120
  lat (msec)   : 10=0.02%, 50=1.67%, 100=20.68%, 250=77.63%
  cpu          : usr=0.14%, sys=0.29%, ctx=10455, majf=0, minf=26
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5875,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862700: Sun Feb 16 18:40:00 2025
  read: IOPS=104, BW=419KiB/s (429kB/s)(24.6MiB/60016msec)
    slat (usec): min=1584, max=25910, avg=9525.84, stdev=4049.61
    clat (msec): min=6, max=232, avg=142.86, stdev=57.38
     lat (msec): min=19, max=247, avg=152.39, stdev=61.05
    clat percentiles (msec):
     |  1.00th=[   40],  5.00th=[   44], 10.00th=[   54], 20.00th=[   78],
     | 30.00th=[   94], 40.00th=[  144], 50.00th=[  163], 60.00th=[  178],
     | 70.00th=[  186], 80.00th=[  194], 90.00th=[  207], 95.00th=[  213],
     | 99.00th=[  224], 99.50th=[  228], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  232]
   bw (  KiB/s): min=  264, max= 1424, per=6.77%, avg=419.54, stdev=207.04, samples=120
   iops        : min=   66, max=  356, avg=104.88, stdev=51.76, samples=120
  lat (msec)   : 10=0.02%, 20=0.02%, 50=8.68%, 100=22.79%, 250=68.50%
  cpu          : usr=0.14%, sys=0.31%, ctx=10674, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.8%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6293,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862701: Sun Feb 16 18:40:00 2025
  read: IOPS=100, BW=403KiB/s (412kB/s)(23.6MiB/60018msec)
    slat (usec): min=1301, max=25936, avg=9924.33, stdev=3979.32
    clat (msec): min=6, max=233, avg=148.84, stdev=55.94
     lat (msec): min=18, max=248, avg=158.76, stdev=59.48
    clat percentiles (msec):
     |  1.00th=[   39],  5.00th=[   47], 10.00th=[   59], 20.00th=[   80],
     | 30.00th=[  127], 40.00th=[  155], 50.00th=[  171], 60.00th=[  182],
     | 70.00th=[  188], 80.00th=[  197], 90.00th=[  209], 95.00th=[  215],
     | 99.00th=[  226], 99.50th=[  228], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  234]
   bw (  KiB/s): min=  264, max= 1552, per=6.50%, avg=402.74, stdev=195.71, samples=120
   iops        : min=   66, max=  388, avg=100.68, stdev=48.93, samples=120
  lat (msec)   : 10=0.02%, 20=0.02%, 50=6.34%, 100=19.45%, 250=74.18%
  cpu          : usr=0.15%, sys=0.29%, ctx=10566, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.8%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6041,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862702: Sun Feb 16 18:40:00 2025
  read: IOPS=96, BW=385KiB/s (394kB/s)(22.6MiB/60011msec)
    slat (usec): min=2169, max=20427, avg=10373.02, stdev=3342.66
    clat (msec): min=8, max=232, avg=155.57, stdev=45.57
     lat (msec): min=22, max=247, avg=165.94, stdev=48.39
    clat percentiles (msec):
     |  1.00th=[   58],  5.00th=[   72], 10.00th=[   81], 20.00th=[  103],
     | 30.00th=[  140], 40.00th=[  157], 50.00th=[  171], 60.00th=[  180],
     | 70.00th=[  188], 80.00th=[  194], 90.00th=[  205], 95.00th=[  213],
     | 99.00th=[  222], 99.50th=[  224], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  234]
   bw (  KiB/s): min=  264, max=  848, per=6.22%, avg=385.27, stdev=120.96, samples=120
   iops        : min=   66, max=  212, avg=96.32, stdev=30.24, samples=120
  lat (msec)   : 10=0.02%, 50=0.52%, 100=18.62%, 250=80.84%
  cpu          : usr=0.16%, sys=0.26%, ctx=10387, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5779,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862703: Sun Feb 16 18:40:00 2025
  read: IOPS=99, BW=398KiB/s (407kB/s)(23.3MiB/60017msec)
    slat (usec): min=1483, max=25669, avg=10048.90, stdev=3609.44
    clat (msec): min=6, max=232, avg=150.70, stdev=49.92
     lat (msec): min=18, max=247, avg=160.75, stdev=53.04
    clat percentiles (msec):
     |  1.00th=[   50],  5.00th=[   65], 10.00th=[   69], 20.00th=[   94],
     | 30.00th=[  127], 40.00th=[  150], 50.00th=[  167], 60.00th=[  178],
     | 70.00th=[  186], 80.00th=[  194], 90.00th=[  207], 95.00th=[  215],
     | 99.00th=[  224], 99.50th=[  226], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  232]
   bw (  KiB/s): min=  264, max= 1072, per=6.42%, avg=397.74, stdev=152.09, samples=120
   iops        : min=   66, max=  268, avg=99.43, stdev=38.02, samples=120
  lat (msec)   : 10=0.02%, 20=0.02%, 50=0.97%, 100=21.49%, 250=77.51%
  cpu          : usr=0.14%, sys=0.29%, ctx=10493, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5966,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862704: Sun Feb 16 18:40:00 2025
  read: IOPS=94, BW=379KiB/s (388kB/s)(22.2MiB/60013msec)
    slat (usec): min=1589, max=24774, avg=10548.58, stdev=3434.17
    clat (msec): min=8, max=232, avg=158.19, stdev=47.24
     lat (msec): min=21, max=247, avg=168.74, stdev=50.19
    clat percentiles (msec):
     |  1.00th=[   50],  5.00th=[   62], 10.00th=[   82], 20.00th=[  105],
     | 30.00th=[  144], 40.00th=[  161], 50.00th=[  176], 60.00th=[  184],
     | 70.00th=[  190], 80.00th=[  197], 90.00th=[  209], 95.00th=[  218],
     | 99.00th=[  226], 99.50th=[  228], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  232]
   bw (  KiB/s): min=  264, max= 1096, per=6.11%, avg=378.87, stdev=127.01, samples=120
   iops        : min=   66, max=  274, avg=94.72, stdev=31.75, samples=120
  lat (msec)   : 10=0.02%, 50=1.14%, 100=17.23%, 250=81.61%
  cpu          : usr=0.11%, sys=0.31%, ctx=10322, majf=0, minf=26
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5683,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862705: Sun Feb 16 18:40:00 2025
  read: IOPS=98, BW=395KiB/s (405kB/s)(23.2MiB/60017msec)
    slat (usec): min=1732, max=21503, avg=10109.48, stdev=3529.02
    clat (msec): min=6, max=232, avg=151.60, stdev=48.78
     lat (msec): min=18, max=247, avg=161.71, stdev=51.83
    clat percentiles (msec):
     |  1.00th=[   55],  5.00th=[   71], 10.00th=[   75], 20.00th=[   92],
     | 30.00th=[  128], 40.00th=[  150], 50.00th=[  167], 60.00th=[  178],
     | 70.00th=[  186], 80.00th=[  194], 90.00th=[  207], 95.00th=[  215],
     | 99.00th=[  224], 99.50th=[  226], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  232]
   bw (  KiB/s): min=  272, max=  888, per=6.39%, avg=395.33, stdev=137.19, samples=120
   iops        : min=   68, max=  222, avg=98.83, stdev=34.30, samples=120
  lat (msec)   : 10=0.02%, 20=0.02%, 50=0.62%, 100=22.12%, 250=77.22%
  cpu          : usr=0.14%, sys=0.30%, ctx=10446, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5930,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862706: Sun Feb 16 18:40:00 2025
  read: IOPS=99, BW=400KiB/s (409kB/s)(23.4MiB/60016msec)
    slat (usec): min=6, max=25704, avg=9995.27, stdev=3686.07
    clat (msec): min=6, max=232, avg=150.08, stdev=50.99
     lat (msec): min=19, max=247, avg=160.08, stdev=54.21
    clat percentiles (msec):
     |  1.00th=[   35],  5.00th=[   59], 10.00th=[   73], 20.00th=[   92],
     | 30.00th=[  127], 40.00th=[  153], 50.00th=[  169], 60.00th=[  180],
     | 70.00th=[  186], 80.00th=[  194], 90.00th=[  205], 95.00th=[  213],
     | 99.00th=[  224], 99.50th=[  226], 99.90th=[  228], 99.95th=[  230],
     | 99.99th=[  232]
   bw (  KiB/s): min=  272, max= 1096, per=6.45%, avg=399.87, stdev=154.77, samples=120
   iops        : min=   68, max=  274, avg=99.97, stdev=38.69, samples=120
  lat (msec)   : 10=0.02%, 20=0.02%, 50=2.55%, 100=22.21%, 250=75.21%
  cpu          : usr=0.14%, sys=0.31%, ctx=10477, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5998,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862707: Sun Feb 16 18:40:00 2025
  read: IOPS=94, BW=379KiB/s (388kB/s)(22.2MiB/60014msec)
    slat (usec): min=1382, max=24421, avg=10555.89, stdev=3371.49
    clat (msec): min=6, max=228, avg=158.30, stdev=45.91
     lat (msec): min=20, max=244, avg=168.86, stdev=48.75
    clat percentiles (msec):
     |  1.00th=[   57],  5.00th=[   73], 10.00th=[   82], 20.00th=[  110],
     | 30.00th=[  142], 40.00th=[  159], 50.00th=[  174], 60.00th=[  182],
     | 70.00th=[  190], 80.00th=[  199], 90.00th=[  207], 95.00th=[  215],
     | 99.00th=[  224], 99.50th=[  226], 99.90th=[  228], 99.95th=[  228],
     | 99.99th=[  228]
   bw (  KiB/s): min=  272, max=  872, per=6.11%, avg=378.61, stdev=117.97, samples=120
   iops        : min=   68, max=  218, avg=94.65, stdev=29.49, samples=120
  lat (msec)   : 10=0.02%, 50=0.53%, 100=17.94%, 250=81.51%
  cpu          : usr=0.14%, sys=0.30%, ctx=10343, majf=0, minf=26
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5679,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862708: Sun Feb 16 18:40:00 2025
  read: IOPS=99, BW=397KiB/s (406kB/s)(23.3MiB/60015msec)
    slat (usec): min=1662, max=25998, avg=10068.22, stdev=3614.38
    clat (msec): min=6, max=232, avg=150.99, stdev=50.17
     lat (msec): min=19, max=246, avg=161.06, stdev=53.32
    clat percentiles (msec):
     |  1.00th=[   32],  5.00th=[   68], 10.00th=[   74], 20.00th=[   95],
     | 30.00th=[  130], 40.00th=[  150], 50.00th=[  167], 60.00th=[  180],
     | 70.00th=[  186], 80.00th=[  194], 90.00th=[  205], 95.00th=[  213],
     | 99.00th=[  224], 99.50th=[  226], 99.90th=[  228], 99.95th=[  232],
     | 99.99th=[  232]
   bw (  KiB/s): min=  272, max= 1088, per=6.40%, avg=396.93, stdev=146.53, samples=120
   iops        : min=   68, max=  272, avg=99.23, stdev=36.63, samples=120
  lat (msec)   : 10=0.02%, 20=0.02%, 50=2.89%, 100=19.47%, 250=77.61%
  cpu          : usr=0.15%, sys=0.29%, ctx=10449, majf=0, minf=25
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5954,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862709: Sun Feb 16 18:40:00 2025
  read: IOPS=89, BW=359KiB/s (368kB/s)(21.0MiB/60012msec)
    slat (usec): min=1702, max=24077, avg=11128.64, stdev=3177.69
    clat (msec): min=8, max=232, avg=166.89, stdev=43.00
     lat (msec): min=21, max=247, avg=178.01, stdev=45.64
    clat percentiles (msec):
     |  1.00th=[   35],  5.00th=[   74], 10.00th=[   91], 20.00th=[  140],
     | 30.00th=[  157], 40.00th=[  169], 50.00th=[  180], 60.00th=[  186],
     | 70.00th=[  192], 80.00th=[  201], 90.00th=[  213], 95.00th=[  218],
     | 99.00th=[  226], 99.50th=[  228], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  232]
   bw (  KiB/s): min=  264, max=  952, per=5.80%, avg=359.14, stdev=106.17, samples=120
   iops        : min=   66, max=  238, avg=89.78, stdev=26.54, samples=120
  lat (msec)   : 10=0.02%, 50=1.21%, 100=9.76%, 250=89.01%
  cpu          : usr=0.16%, sys=0.26%, ctx=10263, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5387,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862710: Sun Feb 16 18:40:00 2025
  read: IOPS=102, BW=408KiB/s (418kB/s)(23.9MiB/60014msec)
    slat (usec): min=1707, max=27485, avg=9785.02, stdev=3860.88
    clat (msec): min=7, max=233, avg=146.75, stdev=54.16
     lat (msec): min=20, max=247, avg=156.53, stdev=57.59
    clat percentiles (msec):
     |  1.00th=[   47],  5.00th=[   59], 10.00th=[   67], 20.00th=[   81],
     | 30.00th=[  106], 40.00th=[  144], 50.00th=[  165], 60.00th=[  178],
     | 70.00th=[  188], 80.00th=[  197], 90.00th=[  207], 95.00th=[  218],
     | 99.00th=[  226], 99.50th=[  228], 99.90th=[  232], 99.95th=[  232],
     | 99.99th=[  234]
   bw (  KiB/s): min=  264, max= 1088, per=6.60%, avg=408.40, stdev=168.37, samples=120
   iops        : min=   66, max=  272, avg=102.10, stdev=42.09, samples=120
  lat (msec)   : 10=0.02%, 50=1.52%, 100=27.55%, 250=70.91%
  cpu          : usr=0.15%, sys=0.30%, ctx=10513, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.8%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6126,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
concurrent_reads: (groupid=0, jobs=1): err= 0: pid=2862711: Sun Feb 16 18:40:00 2025
  read: IOPS=89, BW=357KiB/s (365kB/s)(20.9MiB/60013msec)
    slat (usec): min=2895, max=25001, avg=11200.77, stdev=2986.22
    clat (msec): min=8, max=231, avg=167.96, stdev=39.38
     lat (msec): min=21, max=245, avg=179.17, stdev=41.74
    clat percentiles (msec):
     |  1.00th=[   69],  5.00th=[   79], 10.00th=[  101], 20.00th=[  140],
     | 30.00th=[  157], 40.00th=[  169], 50.00th=[  180], 60.00th=[  186],
     | 70.00th=[  192], 80.00th=[  201], 90.00th=[  209], 95.00th=[  215],
     | 99.00th=[  224], 99.50th=[  226], 99.90th=[  230], 99.95th=[  230],
     | 99.99th=[  232]
   bw (  KiB/s): min=  264, max=  816, per=5.76%, avg=356.78, stdev=86.68, samples=120
   iops        : min=   66, max=  204, avg=89.19, stdev=21.66, samples=120
  lat (msec)   : 10=0.02%, 50=0.06%, 100=9.94%, 250=89.99%
  cpu          : usr=0.14%, sys=0.28%, ctx=10257, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.7%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5352,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=6185KiB/s (6333kB/s), 357KiB/s-419KiB/s (365kB/s-429kB/s), io=363MiB (380MB), run=60011-60019msec